# 커피지수 - Part 2
### 2. ID 필드 도출

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
starbucks = pd.read_csv('data/스타벅스.csv')
coffeebean = pd.read_csv('data/커피빈.csv')
ediya = pd.read_csv('data/이디야.csv')
paik = pd.read_csv('data/빽다방.csv')

In [3]:
# 고성군 - 고성(강원), 고성(경남)
# 광역시 - 서울 용산, 서울 서대문, 대전 서구, 대전 유성, 세종
# 행정구 - 수원 장안, 용인 수지, 고양 일산동, 창원 합포, 창원 회원
tmp_gu_dict = {
    '수원': ['장안구', '권선구', '팔달구', '영통구'], 
    '성남': ['수정구', '중원구', '분당구'], 
    '안양': ['만안구', '동안구'], 
    '안산': ['상록구', '단원구'], 
    '고양': ['덕양구', '일산동구', '일산서구'], 
    '용인': ['처인구', '기흥구', '수지구'], 
    '청주': ['상당구', '서원구', '흥덕구', '청원구'], 
    '천안': ['동남구', '서북구'], 
    '전주': ['완산구', '덕진구'], 
    '포항': ['남구', '북구'], 
    '창원': ['의창구', '성산구', '진해구', '마산합포구', '마산회원구']
}

In [6]:
metro_list = ['서울특별시','부산광역시','대구광역시','인천광역시','대전광역시','광주광역시','울산광역시']

def get_ID(df):
    si_name = [None] * len(df)
    for i in df.index:
        if df.시도명[i] in metro_list:
            if len(df.시군구명[i]) == 2:
                si_name[i] = df.시도명[i][:2] + ' ' + df.시군구명[i]      # 서울 중구, 대전 서구
            else:
                si_name[i] = df.시도명[i][:2] + ' ' + df.시군구명[i][:-1]      # 서울 용산, 서울 서대문
        else:
            si_len = len(df.시군구명[i].split())
            if si_len == 1:
                if df.시군구명[i][:-1] == '고성':
                    if df.시도명[i] == '강원도':
                        si_name[i] = '고성(강원)'
                    else:
                        si_name[i] = '고성(경남)'
                elif df.시군구명[i].find('세종') == 0:
                    si_name[i] = '세종'
                else:
                    si_name[i] = df.시군구명[i][:-1]         # 세종, 광명, 김포, 강릉
            else:
                admin_gu = df.시군구명[i].split()[-1]
                for key, value in tmp_gu_dict.items():
                    if admin_gu in value:
                        if len(admin_gu) == 2:
                            si_name[i] = key + ' ' + admin_gu      # 포항 북구, 포항 남구
                        elif len(admin_gu) == 5:
                            si_name[i] = key + ' ' + admin_gu[2:-1]    # 창원 합포, 창원 회원
                        else:
                            si_name[i] = key + ' ' + admin_gu[:-1]     # 수원 팔달, 용인 수지
    return si_name

In [7]:
starbucks['ID'] = get_ID(starbucks)
starbucks.head()

           상호명  시도명 시군구명  ID
0   스타벅스강릉안목항점  강원도  강릉시  강릉
1  스타벅스춘천후평DT점  강원도  춘천시  춘천
2         스타벅스  강원도  춘천시  춘천
3  스타벅스설악워터피아점  강원도  속초시  속초
4         스타벅스  강원도  원주시  원주

In [8]:
starbucks.ID.unique()

array(['강릉', '춘천', '속초', '원주', '인제', '평창', '동해', '홍천', '횡성', '고성(강원)',
       '성남 분당', '용인 기흥', '화성', '수원 팔달', '고양 일산동', '김포', '수원 영통', '파주',
       '광명', '이천', '부천', '안산 단원', '고양 일산서', '안산 상록', '군포', '포천', '평택',
       '의정부', '남양주', '하남', '과천', '고양 덕양', '시흥', '광주', '용인 처인', '의왕', '오산',
       '안성', '양주', '안양 만안', '양평', '안양 동안', '수원 장안', '수원 권선', '성남 중원',
       '동두천', '용인 수지', '성남 수정', '여주', '구리', '가평', '진주', '거제', '김해',
       '창원 합포', '창원 성산', '양산', '창원 의창', '산청', '사천', '밀양', '창원 진해',
       '창원 회원', '하동', '창녕', '통영', '구미', '포항 북구', '포항 남구', '김천', '영양',
       '고령', '안동', '청도', '경주', '경산', '영덕', '문경', '청송', '성주', '광주 서구',
       '광주 동구', '광주 광산', '광주 북구', '광주 남구', '대구 중구', '대구 수성', '대구 북구',
       '대구 동구', '대구 달서', '대구 서구', '대구 남구', '대구 달성', '대전 동구', '대전 서구',
       '대전 유성', '대전 중구', '대전 대덕', '부산 동구', '부산 연제', '부산 사하', '부산 부산진',
       '부산 서구', '부산 동래', '부산 해운대', '부산 사상', '부산 남구', '부산 금정', '부산 중구',
       '부산 강서', '부산 북구', '부산 기장', '부산 수영', '부산 영도', '서울 종로', '서울 서초',
       '서울 양천', '서울 강북', '서울 강남', '서울 영등포', '서울 중랑', '서울 마포', '서울 구로',
       '서울 강서', '서울 중구', '서울 성동', '서울 성북', '서울 용산', '서울 관악', '서울 은평',
       '서울 서대문', '서울 동작', '서울 광진', '서울 강동', '서울 송파', '서울 노원', '서울 동대문',
       '서울 금천', '서울 도봉', '세종', '울산 북구', '울산 남구', '울산 동구', '울산 울주',
       '울산 중구', '인천 부평', '인천 미추홀', '인천 동구', '인천 연수', '인천 남동', '인천 서구',
       '인천 계양', '인천 중구', '인천 옹진', '인천 강화', '여수', '순천', '목포', '광양', '나주',
       '진도', '무안', '전주 완산', '군산', '전주 덕진', '익산', '임실', '부안', '서귀포', '제주',
       '천안 서북', '천안 동남', '공주', '보령', '당진', '아산', '서산', '서천', '논산', '예산',
       '청양', '계룡', '청주 서원', '청주 흥덕', '청주 청원', '청주 상당', '충주', '음성', '증평',
       '보은', '제천'], dtype=object)

In [9]:
len(starbucks.ID.unique())

191

In [10]:
coffeebean['ID'] = get_ID(coffeebean)
len(coffeebean.ID.unique())

92

In [11]:
ediya['ID'] = get_ID(ediya)
len(ediya.ID.unique())

238

In [12]:
paik['ID'] = get_ID(paik)
len(paik.ID.unique())

174

In [13]:
# 모든 단위 도시의 합집합
city_set = set(starbucks.ID.unique()) | set(coffeebean.ID.unique()) | \
           set(ediya.ID.unique()) | set(paik.ID.unique())
len(city_set)

244

In [16]:
# starbucks 만 있고, ediya/paik이 없는 곳
set(starbucks.ID.unique()) - set(ediya.ID.unique()) - set(paik.ID.unique())

{'계룡', '고성(강원)', '영양', '진도'}

- 브랜드별 매장수 계산

In [39]:
starbucks.groupby('ID')[['상호명']].count().head()

    상호명
ID
가평    2
강릉    4
거제    6
경산    8
경주    7

In [40]:
pt_sb = starbucks.groupby('ID')[['상호명']].count()
pt_sb.reset_index(inplace=True)
pt_sb.rename(columns={'상호명':'스타벅스'}, inplace=True)
pt_sb.head()

   ID  스타벅스
0  가평     2
1  강릉     4
2  거제     6
3  경산     8
4  경주     7

In [41]:
pt_cb = coffeebean.groupby('ID')[['상호명']].count()
pt_cb.reset_index(inplace=True)
pt_cb.rename(columns={'상호명':'커피빈'}, inplace=True)
pt_cb.head()

       ID  커피빈
0      경주    2
1   고양 덕양    1
2  고양 일산동    1
3  고양 일산서    1
4      광명    1

In [42]:
pt_ed = ediya.groupby('ID')[['상호명']].count()
pt_ed.reset_index(inplace=True)
pt_ed.rename(columns={'상호명':'이디야'}, inplace=True)
pt_ed.head()

   ID  이디야
0  가평    9
1  강릉   17
2  강진    1
3  거제    9
4  거창    1

In [43]:
pt_bd = paik.groupby('ID')[['상호명']].count()
pt_bd.reset_index(inplace=True)
pt_bd.rename(columns={'상호명':'빽다방'}, inplace=True)
pt_bd.head()

   ID  빽다방
0  강릉    2
1  거창    1
2  경산    4
3  경주    1
4  고령    1

In [44]:
len(pt_sb), len(pt_cb), len(pt_ed), len(pt_bd)

(191, 92, 238, 174)

- 커피샵 데이터 병합

In [45]:
cf = pd.merge(pt_ed, pt_sb, how='left')
cf.head()

   ID  이디야  스타벅스
0  가평    9   2.0
1  강릉   17   4.0
2  강진    1   NaN
3  거제    9   6.0
4  거창    1   NaN

In [46]:
cf = pd.merge(cf, pt_cb, how='left')
cf = pd.merge(cf, pt_bd, how='left')
cf.head()

   ID  이디야  스타벅스  커피빈  빽다방
0  가평    9   2.0  NaN  NaN
1  강릉   17   4.0  NaN  2.0
2  강진    1   NaN  NaN  NaN
3  거제    9   6.0  NaN  NaN
4  거창    1   NaN  NaN  1.0

In [47]:
cf.fillna(0, inplace=True)
cf.스타벅스 = cf.스타벅스.astype(int)
cf.커피빈 = cf.커피빈.astype(int)
cf.빽다방 = cf.빽다방.astype(int)
cf.head()

   ID  이디야  스타벅스  커피빈  빽다방
0  가평    9     2    0    0
1  강릉   17     4    0    2
2  강진    1     0    0    0
3  거제    9     6    0    0
4  거창    1     0    0    1

In [48]:
cf['커피지수'] = (cf.스타벅스+cf.커피빈) / (cf.이디야+cf.빽다방)
cf.head()

   ID  이디야  스타벅스  커피빈  빽다방      커피지수
0  가평    9     2    0    0  0.222222
1  강릉   17     4    0    2  0.210526
2  강진    1     0    0    0  0.000000
3  거제    9     6    0    0  0.666667
4  거창    1     0    0    1  0.000000

In [50]:
cf.to_csv('data/커피지수.csv', index=False)